{
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 32768,
  "model_type": "qwen2",
  "num_attention_heads": 16,
  "num_key_value_heads": 2,
  "num_hidden_layers": 1,
  "pad_token_id": 151643,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": true,
  "torch_dtype": "float16",
  "transformers_version": "4.57.1",
  "use_cache": true,
  "vocab_size": 151936,
  "draft_vocab_size": 151936,
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "use_sliding_window": false
}
